Autodesk.Revit.DB.ParameterFilterElement.GetElementFilterParametersForCategory(Autodesk.Revit.DB.ElementId)
Retrieves a list of the parameters associated with all rules in the filter
that are combined (using logical AND) with a FilterCategoryRule corresponding to single %categoryId%.
Remarks:
Note that in the case when InvalidElementId specified as input %categoryId% this function returns
parameters common to all categories used by this ParameterFilterElement,
i.e. it is equivalent to ParameterFilterElement.GetElementFilterParameters().
categoryId:
The category for which parameters should be found.
Returns:
A set of parameter identifiers.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2020

Autodesk.Revit.DB.ParameterFilterElement.GetElementFilterParameters
Retrieves a list of the parameters associated with each rule in the filter.
Remarks:
This function returns only parameters used by this ParameterFilterElement that are common
to all categories specified in this ParameterFilterElement.
The ElementFilter may also contain parameters specific to one of the categories
and not necessarily common to all categories specified in this ParameterFilterElement.
To get those parameters, use ParameterFilterElement.GetElementFilterParametersForCategory().
Returns:
A set of parameter identifiers.
Since:
2019

Autodesk.Revit.DB.ParameterFilterElement.AllRuleParametersApplicable(Autodesk.Revit.DB.ElementFilter)
Checks that the parameters of the rules used by the given ElementFilter are valid for this filter's categories.
elementFilter:
The ElementFilter containing the rules to check.
Returns:
True if all the parameters of the given rules are valid for this filter, otherwise false.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2019

Autodesk.Revit.DB.ParameterFilterElement.AllRuleParametersApplicable(Autodesk.Revit.DB.Document,System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId},Autodesk.Revit.DB.ElementFilter)
Checks that the parameters of the given ElementFilter (representing a combination of rules)
are valid for the given set of categories.
aDocument:
The document containing the filter, categories, and parameters involved in this validation.
categories:
The set of categories against which to check the rule parameters.
elementFilter:
The ElementFilter representing the combination of rules to check.
Returns:
True if all the parameters of the given rules are valid for this filter, otherwise false.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2019

Autodesk.Revit.DB.ParameterFilterElement.SetElementFilter(Autodesk.Revit.DB.ElementFilter)
Sets the rules that must be satisfied for a given element to pass this filter.
Remarks:
Note that in some situation, calling GetElementFilter after calling SetElementFilter
may return an ElementFilter that is structurally different from the one passed as input
to SetElementFilter. For example, if the input ElementFilter contains an ElementParameterFilter
that contains more than one FilterRule, and if the view filters dialog box is used in between
the calls to SetElementFilter and GetElementFilter, the output ElementFilter will use a single
ElementParameterFilter for each of the FilterRules that were bundled in an input ElementParameterFilter.
The two ElementFilters will be logically and functionally equivalent in the sense that any given
Element will either be accepted by both ElementFilters or rejected by both ElementFilters.
elementFilter:
An ElementFilter representing the rules. It may be an ElementParameterFilter
representing a conjunction of one or more FilterRules, or an ElementLogicalFilter
(of type LogicalAndFilter or LogicalOrFilter) representing a logical combination
of FilterRules, using AND/OR operations.
Returns:
Returns true if this ParameterFilterElement was changed, false if not.
It will not be changed if the input rules are equivalent to the ParameterFilterElement's
existing rules.
Throws Autodesk.Revit.Exceptions.ArgumentException:
One of the given rules refers to a parameter that does not apply to this filter's categories.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentsInconsistentException:
The ElementFilter is not acceptable for use by a ParameterFilterElement.
Since:
2019

Autodesk.Revit.DB.ParameterFilterElement.GetElementFilter
Returns an ElementFilter representing the combination of rules used by this filter.
Remarks:
May return null when no rules are sprcified in ParameterFilterElement, only categories.
Note that in some situation, calling GetElementFilter after calling SetElementFilter
may return an ElementFilter that is structurally different from the one passed as input
to SetElementFilter. For example, if the input ElementFilter contains an ElementParameterFilter
that contains more than one FilterRule, and if the view filters dialog box is used in between
the calls to SetElementFilter and GetElementFilter, the output ElementFilter will use a single
ElementParameterFilter for each of the FilterRules that were bundled in an input ElementParameterFilter.
The two ElementFilters will be logically and functionally equivalent in the sense that any given
Element will either be accepted by both ElementFilters or rejected by both ElementFilters.
Returns:
An ElementFilter representing the rules. It may be an ElementParameterFilter
representing a conjunction of one or more FilterRules, or an ElementLogicalFilter
(of type LogicalAndFilter or LogicalOrFilter) representing a logical combination
of FilterRules, using AND/OR operations.
Since:
2019

Autodesk.Revit.DB.ParameterFilterElement.ElementFilterIsAcceptableForParameterFilterElement(Autodesk.Revit.DB.Document,System.Collections.Generic.ISet{Autodesk.Revit.DB.ElementId},Autodesk.Revit.DB.ElementFilter)
Checks that an ElementFilter is acceptable for use in defining the filtering rules
for a given list of categories (i.e., for view filtering).
Remarks:
ElementFilter is either an ElementParameterFilter or an ElementLogicalFilter
representing a Boolean combination of ElementParameterFilters. In addition, we check that
each ElementParameterFilter satisfies the following conditions:
Its array of FilterRules is not empty and contains:
Any number of FilterRules of type FilterValueRule, FilterInverseRule, and SharedParameterApplicableRule or Exactly one FilterCategoryRule containing only one category from categories stored by this ParameterFilterElement or Exactly two rules: the first one is a FilterCategoryRule containing only one category from categories stored by this ParameterFilterElement and
the second one is a FilterRule of type FilterValueRule, FilterInverseRule, or SharedParameterApplicableRule.
Note that cases in the second and third bullet are currently allowed only if the parent node of ElementParameterFilter is LogicalOrFilter.
aDocument:
The document in which to create the ParameterFilterElement.
categories:
The categories for the new ParameterFilterElement.
elementFilter:
The ElementFilter to validate.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2019

Autodesk.Revit.DB.ParameterFilterElement.ElementFilterIsAcceptableForParameterFilterElement(Autodesk.Revit.DB.ElementFilter)
Checks that an ElementFilter is acceptable for use in defining the filtering rules
for a ParameterFilterElement (i.e., for view filtering).
Remarks:
ElementFilter is either an ElementParameterFilter or an ElementLogicalFilter
representing a Boolean combination of ElementParameterFilters. In addition, we check that
each ElementParameterFilter satisfies the following conditions:
Its array of FilterRules is not empty and contains:
Any number of FilterRules of type FilterValueRule, FilterInverseRule, and SharedParameterApplicableRule or Exactly one FilterCategoryRule containing only one category from categories stored by this ParameterFilterElement or Exactly two rules: the first one is a FilterCategoryRule containing only one category from categories stored by this ParameterFilterElement and
the second one is a FilterRule of type FilterValueRule, FilterInverseRule, or SharedParameterApplicableRule.
Note that cases in the second and third bullet are currently allowed only if the parent node of ElementParameterFilter is LogicalOrFilter.
elementFilter:
The ElementFilter to validate.
Returns:
True if the ElementFilter is acceptable for use by an ParameterFilterElement, false if not.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2019

Autodesk.Revit.DB.ParameterFilterElement.SetCategories(System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId})
Sets the categories admitted by this filter.
Remarks:
Testing that an element's category is a member of this set is,
essentially, the first rule of the filter.
Changing the set of categories will clear any rules that use parameters
that are not applicable for the new set of categories.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2011

Autodesk.Revit.DB.ParameterFilterElement.Create(Autodesk.Revit.DB.Document,System.String,System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId},Autodesk.Revit.DB.ElementFilter)
Creates a new ParameterFilterElement in the given document.
aDocument:
The document in which to create the ParameterFilterElement.
name:
The user-visible name for the new ParameterFilterElement.
categories:
The categories for the new ParameterFilterElement.
elementFilter:
The rules for the new ParameterFilterElement, represented as an ElementFilter.
ElementFilter is either an ElementParameterFilter or an ElementLogicalFilter
representing a Boolean combination of ElementParameterFilters. In addition, we check that
each ElementParameterFilter satisfies the following conditions:
Its array of FilterRules is not empty and contains:
Any number of FilterRules of type FilterValueRule, FilterInverseRule, and SharedParameterApplicableRule or Exactly one FilterCategoryRule containing only one category from categories stored by this ParameterFilterElement or Exactly two rules: the first one is a FilterCategoryRule containing only one category from categories stored by this ParameterFilterElement and
the second one is a FilterRule of type FilterValueRule, FilterInverseRule, or SharedParameterApplicableRule.
Note that cases in the second and third bullet are currently allowed only if the parent node of ElementParameterFilter is LogicalOrFilter.
Returns:
A pointer to the new ParameterFilterElement.
Throws Autodesk.Revit.Exceptions.ArgumentException:
name is an empty string or contains only whitespace.
-or-
name cannot include prohibited characters, such as "{, }, [, ], |, ;, less-than sign, greater-than sign, ?, `, ~".
-or-
The given value for name is already in use as a filter element name.
-or-
One of the given rules refers to a parameter that does not apply to this filter's categories.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentsInconsistentException:
The ElementFilter is not acceptable for use by a ParameterFilterElement.
Since:
2019

Autodesk.Revit.DB.ParameterFilterElement.Create(Autodesk.Revit.DB.Document,System.String,System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId})
Creates a new ParameterFilterElement in the given document.
aDocument:
The document in which to create the ParameterFilterElement.
name:
The user-visible name for the new ParameterFilterElement.
categories:
The categories for the new ParameterFilterElement.
Returns:
A pointer to the new ParameterFilterElement.
Throws Autodesk.Revit.Exceptions.ArgumentException:
name is an empty string or contains only whitespace.
-or-
name cannot include prohibited characters, such as "{, }, [, ], |, ;, less-than sign, greater-than sign, ?, `, ~".
-or-
The given value for name is already in use as a filter element name.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2011